cask_args appdir: "/Applications"

# --- TAPS ---

# Tap Homebrew
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "bramstein/webfonttools"

# --- INSTALLS ---

# More recent versions of macOS tools
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "binutils"
brew "bash"
brew "bash-completion2"
brew "zsh"
brew "zsh-completions"
brew "wget"
brew "curl"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "git"
brew "vim"
brew "grep"
brew "openssh"
brew "screen"
brew "gmp"

#  Font
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"

# System
brew "rename"
brew "tree"
brew "pstree"
brew "mas"
brew "htop"
brew "pidof"
brew "watch"

# Dev
brew "awscli"
brew "hub"
brew "starship" #zsh theme
brew "graphviz"
brew "go"

# --- CASKS ---

# Font
cask "font-fira-code"

# Chat
cask "telegram"
cask "whatsapp"
cask "slack"
cask "zoom"

# Desktop
cask "intellidock"
cask "grid"
cask "skitch"
cask "the-unarchiver"
cask "the-archive-browser"
cask "google-chrome"
cask "fantastical"
cask "dropbox"
cask "deepl"

# Security
cask "1password"

# Text
cask "notion"
cask "sublime-text"
cask "visual-studio-code"

# Dev
cask "zulu"
cask "postman"
cask "sourcetree"
cask "docker"
cask "jetbrains-toolbox"

# Fun
cask "spotify"
cask "vlc"
cask "kindle"
