cask_args appdir: "/Applications"

# --- INSTALLS ---

# More recent versions of macOS tools
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "binutils"
brew "bash"
brew "bash-completion2"
brew "zsh"
brew "zsh-completions"
brew "wget"
brew "curl"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "git"
brew "vim"
brew "grep"
brew "openssh"
brew "screen"
brew "gmp"

#  Font
brew "woff2"

# System
brew "rename"
brew "tree"
brew "pstree"
brew "mas"
brew "htop"
brew "pidof"
brew "watch"

# Modern CLI replacements
brew "bat"       # cat with syntax highlighting
brew "eza"       # modern ls
brew "fd"        # modern find
brew "ripgrep"   # modern grep (rg)
brew "fzf"       # fuzzy finder
brew "git-delta" # modern diff for git
brew "zoxide"    # smarter cd/z
brew "jq"        # JSON processor
brew "tlrc"       # simplified man pages (tldr client)

# Dev
brew "awscli"
brew "starship" #zsh theme
brew "graphviz"
brew "go"
brew "gh"
brew "libpq"  # Postgres client tools (psql); .zshrc adds /opt/homebrew/opt/libpq/bin to PATH

# --- CASKS ---

# Terminal
cask "ghostty"

# Font
cask "font-fira-code"

# Chat
cask "whatsapp"
cask "zoom"
cask "granola"
cask "slack"

# Browsers
cask "google-chrome"
cask "arc"

# Desktop
cask "shottr"
cask "the-unarchiver"
cask "calendr"
cask "rectangle"

# Security
cask "1password"
cask "nordvpn"

# Text / Notes
cask "notion"
cask "obsidian"
cask "sublime-text"
cask "zed"

# AI
cask "claude"        # Anthropic desktop app
cask "claude-code"   # Anthropic CLI
cask "wispr-flow"
cask "openusage"     # AI-coding usage tracker

# Dev
cask "zulu"
cask "postman"
cask "sourcetree"
cask "docker-desktop"
cask "linear"
cask "bruno"

# Fun
cask "spotify"
cask "vlc"
cask "steam"
